/*■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
	ファイル名	：	/Mul_light/Kernel/WM/Define/WM_Window.h
	概要		：	ウィンドウ管理 - ウィンドウ関連定義ヘッダ
	詳細		：
	責任者		：	佐合 秀昭
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■*/

#pragma	once


/*■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
	定数・マクロ定義
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■*/
/*******************************************************************************
	マウス関連 定数定義
*******************************************************************************/
enum
{
	MPT_T_ARROW		= 0x0001,		//縦
	MPT_B_ARROW		= 0x0002,		//縦
	MPT_L_ARROW		= 0x0004,		//横
	MPT_R_ARROW		= 0x0008,		//横
	MPT_TL_ARROW	= MPT_T_ARROW | MPT_L_ARROW,		//0x0005	右下斜め
	MPT_BL_ARROW	= MPT_B_ARROW | MPT_L_ARROW,		//0x0006	右上斜め
	MPT_TR_ARROW	= MPT_T_ARROW | MPT_R_ARROW,		//0x0009	右上斜め
	MPT_BR_ARROW	= MPT_B_ARROW | MPT_R_ARROW,		//0x000a	右下斜め
};



/*■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
	グローバル
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■*/
extern const GUI::MPT	GCA_MPT[12];



/*■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
	End of file
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■*/
